//IntroduceTo.vue
<template>
  <div class="pt-[22px] pb-[40px] bg-main-b rounded-[10px] text-left">    
    <InfoListBlock
      :title="infoData.title" 
      :content="infoData.content" 
      :listItems="infoData.listItems"
      
    />
  </div>
</template>

<script setup>
import { ref } from "vue";
import InfoListBlock from "../layout/InfoListBlock.vue"; 


const infoData = ref({
  title: "Преимущества выбора 1xBet",
  content: `Когда вы думаете, где сделать ставку, 1xBet, ведущая компания по приему ставок онлайн, становится лучшим выбором, и вот почему:`,
  listItems: [
    "Обширное покрытие спортивных событий: 1xBet охватывает широкий спектр видов спорта от футбола до настольного тенниса. Это разнообразие гарантирует, что найдется что-то для каждого любителя спорта, независимо от того, насколько узкоспециализированными могут быть его интересы.",
    "Конкурентные коэффициенты: одним из ключевых факторов при выборе букмекера являются предлагаемые им коэффициенты. 1xBet постоянно предоставляет конкурентоспособные коэффициенты, максимизируя потенциальные выигрыши для игроков.",
    "Live-ставки и трансляции: Ощущение от live-ставок не имеет себе равных, и 1xBet улучшает этот опыт, предлагая прямые трансляции многочисленных событий. Эта функция позволяет игрокам принимать обоснованные решения в режиме реального времени.",
    "Удобное мобильное приложение: в современном быстро меняющемся мире доступ к ставкам на ходу имеет решающее значение. Мобильное приложение 1xBet меняет правила игры, предлагая бесперебойный опыт ставок на вашем смартфоне.",
    "Безопасные и надежные транзакции: безопасность является главным приоритетом в 1xBet. Платформа использует передовые методы шифрования для обеспечения безопасности пользовательских данных и финансовых транзакций.",
    "Отличная служба поддержки клиентов: если у вас возникнут какие-либо проблемы, служба поддержки клиентов 1xBet"
]
});
</script>


<style lang="scss" scoped>

</style>