<template>
    <div class="pt-[22px] pb-[40px] bg-main-b rounded-[10px] text-left">
      <InfoShortBlock
        :title="bonus1.title"
        :image="bonus1.image"
        :content="bonus1.content"
      />
      <span class="line-bottom"></span>
      <InfoShortBlock
        :title="bonus2.title"
        :image="bonus2.image"
        :content="bonus2.content"
      />
      <span class="line-bottom"></span>
      <InfoShortBlock
        :title="bonus3.title"
        :image="bonus3.image"
        :content="bonus3.content"
      />
      <span class="line-bottom"></span>
      <InfoShortBlock
        :title="bonus4.title"
        :image="bonus4.image"
        :content="bonus4.content"
      />
      <span class="line-bottom"></span>
      <InfoShortBlock
        :title="bonus5.title"
        :image="bonus5.image"
        :content="bonus5.content"
      />
      <span class="line-bottom"></span>
      <InfoShortBlock
        :title="bonus6.title"
        :image="bonus6.image"
        :content="bonus6.content"
      />
    </div>
  </template>
  
  <script setup>
  import { ref } from "vue";
  import InfoShortBlock from "../layout/InfoShortBlock.vue";
  import image from "../../assets/img/bonus/b-1.png";
  import image2 from "../../assets/img/bonus/b-2.png";
  import image3 from "../../assets/img/bonus/b-3.png";
  import image4 from "../../assets/img/bonus/b-4.png";
  import image5 from "../../assets/img/bonus/b-5.png";
  import image6 from "../../assets/img/bonus/b-6.png";

  
  const bonus1 = ref({
    image: image,
    title: "Эксклюзивные бонусные предложения и сделки 1xBet",
    content: `1xBet выделяется своими эксклюзивными бонусными предложениями и рекламными акциями. Новые пользователи могут воспользоваться выгодными приветственными бонусами, в то время как постоянные игроки получают разнообразные предложения, такие как бесплатные ставки, кэшбэк и накопительный бонус. Эти бонусы улучшают игровой опыт, предлагая больше ценности и возможностей для выигрыша. Благодаря специальным акциям, привязанным к крупным спортивным событиям и киберспортивным турнирам, 1xBet гарантирует, что каждый игрок имеет возможность принять участие в захватывающих и выгодных ставках.`,
  });
  const bonus2 = ref({
    title: "Бонусные вознаграждения за регистрацию",
    content: `1xBet ценит своих новых пользователей привлекательными бонусными вознаграждениями при регистрации. Эти вознаграждения часто включают в себя значительный бонус на первый депозит, который улучшает первоначальный опыт ставок, предоставляя дополнительные средства. Этот бонус можно использовать в различных видах спорта и играх, предлагая новичкам всестороннее знакомство с обширными возможностями ставок, доступными на 1xBet.`,
    image: image2,
  });
  const bonus3 = ref({
    title: "Бонусные вознаграждения за регистрацию",
    content: `1xBet ценит своих новых пользователей привлекательными бонусными вознаграждениями при регистрации. Эти вознаграждения часто включают в себя значительный бонус на первый депозит, который улучшает первоначальный опыт ставок, предоставляя дополнительные средства. Этот бонус можно использовать в различных видах спорта и играх, предлагая новичкам всестороннее знакомство с обширными возможностями ставок, доступными на 1xBet.`,
    image: image3,
  });
  const bonus4 = ref({
    title: "Поощрения в виртуальном казино",
  content: `Виртуальное казино 1xBet — это не просто обширная коллекция игр; это также вознаграждение за участие игроков. Пользователи могут рассчитывать на периодические бонусы, такие как депозитные матчи, бесплатные вращения в определенных слот-играх и эксклюзивный доступ к новым игровым названиям. Эти поощрения делают опыт казино более полезным и приятным.`,
    image: image4,
  });
  const bonus5 = ref({
    title: "Бонусные вращения в слотах",
  content: `Любители слотов на 1xBet получают бонусные вращения в различных слот-играх. Эти вращения часто предоставляются в качестве части приветственных пакетов, специальных акций или наград за игру в определенные слоты. Бонусные вращения дают игрокам дополнительные шансы на победу, улучшая их общий игровой опыт в слотах.`,
    image: image5,
  });
  const bonus6 = ref({
    title: "Возврат средств и предложения по кэшбэку",
  content: `1xBet понимает важность удовлетворенности клиентов и предлагает возвраты и кэшбэк-предложения, чтобы обеспечить приятный игровой опыт. Эти предложения могут включать процент кэшбэка за проигранные ставки или возвраты при определенных условиях. Такие инициативы отражают приверженность 1xBet предоставлению ценности и поддержки своим клиентам, что делает его предпочтительным выбором для многих игроков.`,
    image: image6,
  });
  </script>
  
  <style lang="scss" scoped></style>
  