<template>
  <div class="pt-[22px] pb-[40px] bg-main-b rounded-[10px] text-left">
    <InfoListBlock
      :title="infoData.title"
      :content="infoData.content"
      :image="infoData.image"
      :listItems="infoData.listItems"
    />
    <InfoShortBlock
      :title="criket.title"
      :image="criket.image"
      :content="criket.content"
    />
    <span class="line-bottom"></span>
    <InfoShortBlock
      :title="football.title"
      :image="football.image"
      :content="football.content"
    />
    <span class="line-bottom"></span>
    <InfoShortBlock
      :title="hockey.title"
      :image="hockey.img"
      :content="hockey.content"
    />
    <span class="line-bottom"></span>
    <InfoShortBlock
      :title="valley.title"
      :image="valley.img"
      :content="valley.content"
    />
    <span class="line-bottom"></span>

    <InfoShortBlock
      :title="basketball.title"
      :image="basketball.img"
      :content="basketball.content"
    />
    <span class="line-bottom"></span>

    <InfoShortBlock
      :title="tenis.title"
      :image="tenis.img"
      :content="tenis.content"
    />
    <span class="line-bottom"></span>

    <InfoShortBlock
      :title="tableTenis.title"
      :image="tableTenis.img"
      :content="tableTenis.content"
    />
    <span class="line-bottom"></span>

    <InfoShortBlock
      :title="boxing.title"
      :image="boxing.img"
      :content="boxing.content"
    /> 
    <span class="line-bottom"></span>

    <InfoShortBlock
      :title="horse.title"
      :image="horse.img"
      :content="horse.content"
    />
    <span class="line-bottom"></span>

    <InfoShortBlock
      :title="race.title"
      :image="race.img"
      :content="race.content"
    /> 

  </div>
</template>

<script setup>
import { ref } from "vue";
import InfoListBlock from "../layout/InfoListBlock.vue";
import InfoShortBlock from "../layout/InfoShortBlock.vue"

import varietyImg from "../../assets/img/variety.png";
import criketImg from "../../assets/img/sport/basketball.png"
import footballImg from "../../assets/img/sport/football.png"
import hockeyImg from "../../assets/img/sport/hockey.png"
import basketballImg from "../../assets/img/sport/basketball.png";
import valleyImg from "../../assets/img/sport/volleyball.png";

import tableTenisImg from "../../assets/img/sport/tennis-tables.png"; 
import tenisImg from "../../assets/img/sport/tennis-b.png";

import boxingImg from "../../assets/img/sport/box.png";
import horseImg from "../../assets/img/sport/horse.png";
import raceImg from "../../assets/img/sport/prix.png";


const infoData = ref({
  title: "Разнообразие ставок на спорт на 1xBet для игроков из Японии",
  content: `1xBet удовлетворяет разнообразные предпочтения японских игроков с его широким выбором вариантов ставок на спорт онлайн 1xbet. Основные предложения включают:`,
  image: varietyImg,
  listItems: [
    "Футбол: самый популярный вид спорта в Японии, широко представленный в ведущих лигах и турнирах по всему миру.",
    "Баскетбол: Ставки на баскетбол пользуются большой популярностью среди японских игроков — от НБА до местных лиг.",
    "Бадминтон и настольный теннис: эти виды спорта занимают особое место в сердцах японцев. 1xBet предлагает множество вариантов ставок на оба вида спорта.",
    "Киберспорт: Ставки на киберспорт набирают популярность, в том числе на такие игры, как League of Legends и Dota 2, которые пользуются огромной популярностью в Японии.",
    "Традиционные японские виды спорта: учитывая вкусы местных жителей, 1xBet также предлагает варианты ставок на виды спорта, характерные только для Японии.",
  ],
});

const criket = ref({
  title: "Ставки на крикет",
  content: `1xBet блистает в сфере ставок на крикет, предлагая широкий спектр рынков как для любителей, так и для профессиональных любителей ставок 1xbet. Болельщики могут делать ставки до и во время матча на различные международные и внутренние лиги, включая Индийскую премьер-лигу (IPL), один из самых известных турниров по крикету в мире. С такими опциями, как лучший бэтсмен, лучший боулер и общее количество ранов, 1xBet предоставляет комплексный опыт ставок, который учитывает тонкости и сложности крикета.`,
  image: criketImg, // Исправлено на criketImg
});
const football = ref({
  title: "Ставки на футбол",
  content: `Футбол, самый популярный вид спорта в мире, получает исключительное освещение на 1xBet, лидере в спортивных ставках 1xbet. Игроки могут получить доступ к множеству рынков, начиная от английской Премьер-лиги и заканчивая Лигой чемпионов УЕФА. Уникальные варианты ставок, такие как первый забитый гол, общее количество угловых и азиатские гандикапы, улучшают опыт ставок. 1xBet также предлагает ставки на футбол в режиме реального времени, что позволяет игрокам извлекать выгоду из динамичного характера игры.`,
  image: footballImg,
});
const hockey = ref({
  title: "Ставки на хоккей",
  content: `1xBet, выделяющийся среди таких сайтов ставок, как 1xbet, охватывает широкий спектр хоккейных лиг, включая НХЛ, КХЛ и различные европейские лиги. Игроки могут побаловать себя разнообразными вариантами ставок, такими как линия шайбы, тотал голов и ставки на период. Функция ставок в реальном времени добавляет дополнительный уровень азарта, позволяя игрокам делать стратегические ставки по мере развития игры.`,
  img: hockeyImg,
});
const basketball = ref({
  title: "Ставки на баскетбол",
  content: `Ставки на баскетбол на 1xBet, известном своим опытом в ставках 1x, — это настоящий подарок для энтузиастов. Платформа охватывает такие крупные лиги, как НБА, Евролига и национальные чемпионаты по всему миру. Рынки ставок включают ставки на разницу очков, больше/меньше очков и ставки на результаты игроков. Благодаря ставкам в реальном времени и стриминговым сервисам поклонники баскетбола могут оставаться в курсе событий и принимать решения в режиме реального времени.`,
  img: basketballImg,
});
const valley = ref({
  title: "Волейбольные матчи",
  content: `1xBet, ведущая букмекерская контора 1xbet, онлайн-платформа ставок на спорт, предлагает всестороннее покрытие для поклонников волейбола, охватывая крупные международные соревнования и местные лиги. Игроки могут использовать различные варианты ставок, включая победителей матчей, счет сетов и общее количество очков. Функция ставок в реальном времени на платформе позволяет делать динамичные ставки, отражая стремительный характер волейбола. Будь то чемпионат мира FIVB или матчи местных лиг, 1xBet гарантирует первоклассный опыт ставок для любителей волейбола.`,
  img: valleyImg,
});
const tenis = ref({
  title: "Теннисные турниры",
  content: `Ставки на теннис на 1xBet, известном сайте ставок 1xbet, охватывают все основные турниры, включая турниры Большого шлема, ATP и WTA. Игроки могут насладиться рядом рынков, таких как победители матчей, ставки на сеты и прогнозы правильного счета. Глубокое покрытие платформы также включает менее известные турниры, предлагая полный опыт ставок на теннис. Варианты ставок в реальном времени добавляют дополнительные острые ощущения, позволяя игрокам делать ставки в тот момент, когда разворачиваются действия на корте.`,
  img: tenisImg,
});
const tableTenis = ref({
  title: "Игры в пинг-понг",
  content: `1xBet, лидер в области ставок онлайн 1xbet, признает растущую популярность настольного тенниса и предлагает обширные варианты ставок на игры в пинг-понг. От международных чемпионатов до местных турниров, платформа предлагает разнообразные рынки, включая победителей матчей, общее количество очков и ставки с гандикапом. Также доступны ставки Live на матчи по настольному теннису, что дает игрокам возможность заниматься спортом в режиме реального времени.`,
  img: tableTenisImg,
});
const boxing = ref({
  title: "Боксерские поединки",
  content: `Любители бокса найдут освещение спорта на 1xBet всеобъемлющим и увлекательным. Платформа предлагает варианты ставок на основные боксерские поединки, включая титульные бои и поединки андеркарта. Рынки включают в себя явных победителей, ставки на раунды и метод победы. Благодаря подробной статистике и анализу игроки могут принимать обоснованные решения и наслаждаться захватывающим опытом ставок на бокс.`,
  img: boxingImg,
});
const horse = ref({
  title: "Скачки",
  content: `1xBet предоставляет широкий выбор для любителей скачек. Охватывая события от престижного Кентуккийского дерби до местных скачек, платформа предлагает множество вариантов ставок, таких как ставки на победу, место и ставки на два исхода. Прямая трансляция скачек и обновление коэффициентов в режиме реального времени улучшают опыт ставок, позволяя игрокам принимать обоснованные решения и в полной мере наслаждаться азартом скачек.`,
  img: horseImg,
});
const race = ref({
  title: "Гонки Гран-при",
  content: `Гонки Гран-при, в частности Формула-1, занимают видное место на 1xBet. Поклонники скоростных автогонок могут делать ставки на своих любимых гонщиков и команды в различных событиях Гран-при по всему миру. Платформа предлагает разнообразные рынки ставок, включая победителей гонок, призеров и чемпионов среди конструкторов, а также подробную статистику и обновления в реальном времени для захватывающего опыта ставок.`,
  img: raceImg,
});
</script>

<style lang="scss" scoped></style>
